Revit 2024 API
DataTransferProgressChangedEventArgs.TransferMode Property
 Data transfer mode in this event.
Namespace: Autodesk.Revit.DB.Events
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2017 Subscription Update
Syntax
C#
public DataTransferMode TransferMode { get; }
Visual Basic
Public ReadOnly Property TransferMode As DataTransferMode
	Get
Visual C++
public:
property DataTransferMode TransferMode {
	DataTransferMode get ();
}
See Also
DataTransferProgressChangedEventArgs Class
Autodesk.Revit.DB.Events Namespace